Revit 2026 API

# CanExecuteEventArgs Class

---

The event arguments used by AddInCommandBinding's CanExecute event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitEventArgs Autodesk.Revit.UI.EventsCommandEventArgs Autodesk.Revit.UI.EventsCanExecuteEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CanExecuteEventArgs : CommandEventArgs
```
```vb
Public Class CanExecuteEventArgs
	Inherits CommandEventArgs
```
```cpp
public ref class CanExecuteEventArgs : public CommandEventArgs
```
```fsharp
type CanExecuteEventArgs =
    class
        inherit CommandEventArgs
    end
```

The CanExecuteEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ActiveDocument | The active document. (Inherited from CommandEventArgs) |
|  | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. (Inherited from RevitEventArgs) |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitEventArgs) |
|  | CanExecute | The value that indicates whether the Command associated with this event can be executed. |
|  | CommandId | The command id. (Inherited from CommandEventArgs) |
|  | IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSelectedCategoryIds | Gets the category ids of selected elements. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace